/*任务21

选用合适的方式，编写程序，使其输出“我在慕课网上学习IT技能！”。

在代码编辑器中

第3、5、12行根据注释提示填写相应代码

运行结果为

	我在慕课网上学习IT技能！

*/
#include <stdio.h>
/* 定义say函数 */
void say(char string[])       //数组参数
{
	//puts(string);//打印字符串方式2
	printf("%s\n", string);//打印字符串方式1
}

int main()
{
	//定义字符串数组,方式1
	char string[] = "我在慕课网上学习IT技能！";
	//定义字符串数组,方式2,由于无法用中文，因此用英文
	//char string[] = {'I','\'','m',' ','l','e','a','r','n','i','n','g',' ','I','T',' ','s','k','i','l','l','s',' ','i','n','','i','m','o','o','c',' ','!'};
	say(string);                 //调用say函数输出字符串
	return 0;
}