/*任务3
请使用for循环，倒序打印9*9乘法表。打印结果如下所示：
9*1=9  9*2=18  9*3=27  9*4=36  9*5=45  9*6=54  9*7=63  9*8=72  9*9=81
8*1=8  8*2=16  8*3=24  8*4=32  8*5=40  8*6=48  8*7=56  8*8=64
7*1=7  7*2=14  7*3=21  7*4=28  7*5=35  7*6=42  7*7=49
6*1=6  6*2=12  6*3=18  6*4=24  6*5=30  6*6=36
5*1=5  5*2=10  5*3=15  5*4=20  5*5=25
4*1=4  4*2=8  4*3=12  4*4=16
3*1=3  3*2=6  3*3=9
2*1=2  2*2=4
1*1=1
程序分析：
观察乘号两边的数字，前者是递减，后者是递增。
*/

#include <stdio.h>
int main()
{
	// 定义相乘数字i,j以及结果result
	int i, j, result;
	/*
	 * 使用for循环解决本题相对简单哦~
	 * 小编偷偷的将源码放在任务“不会了怎么办”中了哦~
	 * 小编希望童鞋们独立完成哦~
	 */
	for (i = 9; i >= 1; i--)
	{
		for (j = 1; j <= i; j++)
		{
			printf("%d*%d=%d  ", i, j, result = i * j);
		}
		printf("\n");
	}
	return 0;
}