/*任务22

以下程序中的主方法中分别定义名为arr1和arr2的两行两列的二维整型数组。
arr1使用第一种初始化，arr2使用第二种初始化。
分别给arr1和arr2数组元素初始化为10,20,30，40。
第一行元素为10和20，第二行元素为30和40。

本节为体验小节，不做正确性验证
具体内容见下方主函数注释内容
*/
#include <stdio.h>
int main()
{
	//使用第一种方式初始化方式声明并初始化二维数组arr1
	/*
		int arr1[][2] = { {10,20},{30,40} };
	*/
	
	//使用第二种方式初始化方式声明并初始化二维数组arr2
	/*
		int arr2[2][2];
		arr2[0][0] = 10; arr2[0][1] = 20;
		arr2[1][0] = 30; arr2[1][1] = 40;
	*/

/*任务23
	
	现有三行三列的二维数组
	int arr[3][3] = { {1,2,3},{4,5,6},{7,8,9} };
	编写程序实现计算对角线元素之和。

*/
	//声明数组
	int arr[3][3] = { {1,2,3},{4,5,6},{7,8,9} };
	//开始遍历数组
	//注意，循环数可以先不赋值，在循环体中赋值
	//但是和数则需要先赋值，否则会出错
	int i, j;			//循环数
	int sum=0;			//数组元素和数
	int lineSum=0;		//对角线元素和数
	//计算数组元素和
	for (i = 0; i < 3; i++)
	{
		for(j = 0; j < 3; j++)
		{
			sum += arr[i][j];
			printf("arr[%d][%d]=%d",i,j,arr[i][j]);
		}
		printf("\n");
	}
	printf("数组元素之和是:%d\n", sum);
	//计算对角线元素和
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 3; j++)
		{
			if (i + j == 2 || i == j)
				lineSum += arr[i][j];
			else
			{
					
			}
				continue;
		}
	}
	printf("\n对角线元素之和是:%d\n", lineSum);
	return 0;
}